### Heroes Of Pymoli Data Analysis
* Of the 1163 active players, the vast majority are male (84%). There also exists, a smaller, but notable proportion of female players (14%).

* Our peak age demographic falls between 20-24 (44.8%) with secondary groups falling between 15-19 (18.60%) and 25-29 (13.4%).  
-----

### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [70]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
file_to_load = "purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

In [71]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count
* Display the total number of players

In [69]:
print(f'The total number of players in the data set is : {purchase_data["SN"].nunique()}')
print(f'The total number of unique items, by ID, in the data set is : {purchase_data["Item ID"].nunique()}')

The total number of players in the data set is : 576
The total number of unique items, by ID, in the data set is : 183

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [46]:
tmpdf = purchase_data[['Item ID', 'Item Name']].drop_duplicates()
#tmpdf.nunique()
tmpdf[tmpdf['Item Name'].duplicated()]

     Item ID     Item Name
99       101  Final Critic
251       23      Crucifer
608      132    Persuasion
751      180   Stormcaller

In [50]:
a=purchase_data.loc[purchase_data['Item Name']=='Final Critic',['Item ID', 'Item Name', 'Price']].drop_duplicates()
b=purchase_data.loc[purchase_data['Item Name']=='Crucifer',['Item ID', 'Item Name', 'Price']].drop_duplicates()
c=purchase_data.loc[purchase_data['Item Name']=='Persuasion',['Item ID', 'Item Name', 'Price']].drop_duplicates()
d=purchase_data.loc[purchase_data['Item Name']=='Stormcaller',['Item ID', 'Item Name', 'Price']].drop_duplicates()
a.append(b.append(c.append(d)))

     Item ID     Item Name  Price
2         92  Final Critic   4.88
99       101  Final Critic   4.19
121        1      Crucifer   3.26
251       23      Crucifer   1.99
24       141    Persuasion   3.19
608      132    Persuasion   3.33
166       30   Stormcaller   2.21
751      180   Stormcaller   3.36

In [47]:
pdat = purchase_data    # Short name for reference to purchase_data, not a copy
sumVals = {'Counts Unique':{'Transactions': pdat['Purchase ID'].count(), 
                            'Players':      pdat['SN'].nunique(),
                            'Item IDs':     pdat['Item ID'].nunique(),
                            'Item Names':   pdat['Item Name'].nunique()},
             'Max':{'Purchase Price': pdat['Price'].max(), 'Age': pdat['Age'].max()},
             'Min':{'Purchase Price': pdat['Price'].min(), 'Age': pdat['Age'].min()},
             'Avg':{'Purchase Price': pdat['Price'].mean(),'Age': pdat['Age'].mean()}}
df = pd.DataFrame(sumVals)
df['Avg'] = df['Avg'].round(decimals=2)
df.fillna('',inplace=True)
#df.transpose()
df

               Counts Unique   Max Min    Avg
Age                             45   7  22.71
Item IDs                 183
Item Names               179
Players                  576
Purchase Price                4.99   1   3.05
Transactions             780

In [54]:
summarySer = pd.Series({'Purchase Count':purchase_data['Purchase ID'].count() ,'Unique Items by ID':purchase_data['Item ID'].nunique(), 'Unique Items by Name':purchase_data['Item Name'].nunique(),
    'Unique Players':purchase_data['SN'].nunique(),             
    'Item Price Max':purchase_data['Price'].max(),    'Item Price Min':purchase_data['Price'].min(), 
    'Item Price Average':purchase_data['Price'].mean(), 
    'Player Age Max':purchase_data['Age'].max(),      'Player Age Min':purchase_data['Age'].min(),     'Player Age Average':purchase_data['Age'].mean()},)
summarySer

#(purchase_data['Item ID'].nunique(), purchase_data['Item Name'].nunique(), 
#    purchase_data['Price'].max(),    purchase_data['Price'].min(), 
#    purchase_data['Price'].mean(),   purchase_data['Price'].sum(), 
#    purchase_data['Age'].max(),      purchase_data['Age'].min(),     purchase_data['Age'].mean())
#purchase_data.dtypes
#purchase_data['Item ID'].value_counts()
#purchase_data.describe(percentiles=[])
#type(purchase_data.aggregate({'Item ID':'nunique', 'Item Name':'nunique'})
purchase_data.aggregate({'Price':'max', 'Age':'max'})

Price     4.99
Age      45.00
dtype: float64

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

Reference : https://stackoverflow.com/questions/38309729/count-unique-values-with-pandas-per-groups

In [55]:
GenderSummary  = purchase_data.groupby('Gender')[['SN']].nunique()
TotalPlayerCnt = purchase_data['SN'].nunique()
GenderSummary['Player Percentage'] = (GenderSummary['SN'] / TotalPlayerCnt)*100
GenderSummary.rename(columns={'SN':'Gender Count'}, inplace=True)
GenderSummary
#purchase_data.groupby('Gender')[['SN']].nunique().mean()

                       Gender Count  Player Percentage
Gender
Female                           81          14.062500
Male                            484          84.027778
Other / Non-Disclosed            11           1.909722

                       Total Count  Percentage of Players
Male                           484                  84.03
Female                          81                  14.06
Other / Non-Disclosed           11                   1.91

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [177]:
purchase_data.groupby('Gender').aggregate({'Item ID':'count', 'Price':'mean', 'SN':'nunique'})

                       Item ID     Price   SN
Gender
Female                     113  3.203009   81
Male                       652  3.017853  484
Other / Non-Disclosed       15  3.346000   11

In [170]:
x = purchase_data.groupby('Gender')[['Item ID']].count()
y = purchase_data.groupby('Gender')[['Price']].sum()
z = purchase_data.groupby('Gender')[['Price']].mean()
w = purchase_data.groupby('Gender')[['SN']].nunique()
y['Price'] / w['SN']

Gender
Female                   4.468395
Male                     4.065372
Other / Non-Disclosed    4.562727
dtype: float64

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,"$1,967.64",$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [6]:
# Sample output

       Total Count  Percentage of Players
<10             17                   2.95
10-14           22                   3.82
15-19          107                  18.58
20-24          258                  44.79
25-29           77                  13.37
30-34           52                   9.03
35-39           31                   5.38
40+             12                   2.08

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [7]:
# Sample output

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,"$1,114.06",$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19
<10,23,$3.35,$77.13,$4.54

## Top Spenders

* Run basic calculations to obtain the results in the table below

* Create a summary data frame to hold the results

* Sort the total purchase value column in descending order

* Optional: give the displayed data cleaner formatting

* Display a preview of the summary data frame

In [66]:
# Establish Player group object
spendGroup   = purchase_data.groupby('SN')

# Initialize summary DataFrame with 'Purchase Count' and 'Average Purchase Amount' columns
spendSummary = spendGroup.aggregate({'Item ID':'count', 'Price':'mean'})
spendSummary.rename(columns={'Item ID':'Purchase Count', 'Price':'Average Purchase Amount'}, inplace=True)

# Add column for 'Total Purchase Value' and sort 'Total Purchase Value' in descending order
spendSummary['Total Purchase Value'] = spendGroup['Price'].sum()
spendSummary.sort_values(by='Total Purchase Value', ascending=False, inplace=True)

# Format 'Item Price' and 'Total Purchase Value' columns as currency
spendSummary.head()

             Purchase Count  Average Purchase Amount  Total Purchase Value
SN
Lisosia93                 5                 3.792000                 18.96
Idastidru52               4                 3.862500                 15.45
Chamjask73                3                 4.610000                 13.83
Iral74                    4                 3.405000                 13.62
Iskadarya95               3                 4.366667                 13.10

In [8]:
# Sample output

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns

* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value

* Create a summary data frame to hold the results

* Sort the purchase count column in descending order

* Optional: give the displayed data cleaner formatting

* Display a preview of the summary data frame

In [64]:
# 'Item ID' identifies uniquely each purchase and associated item 'Price' 
#    hence 'Price' value by 'Item ID'/'Item Name' is the same for each purchase
#    i.e. 'Price' value = min, max, mean, first and last aggregates

# Establish group object for purchase_data['Item ID', 'Item Name']
itemGroup   = purchase_data.groupby(['Item ID', 'Item Name'])

# Initialize summary DataFrame with 'Purchase Count' and 'Item Price' columns
itemSummary = itemGroup.aggregate({'Item ID':'count', 'Price':'first'})
itemSummary.rename(columns={'Item ID':'Purchase Count','Price':'Item Price'}, inplace=True)

# Add column for 'Total Purchase Value' and sort 'Purchase Count' in descending order
itemSummary['Total Purchase Value'] = itemGroup['Price'].sum()
itemSummary.sort_values(by='Purchase Count', ascending=False, inplace=True)

# Format 'Item Price' and 'Total Purchase Value' columns as currency
itemSummary.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
145,Fiery Glass Crusader,9,4.58,41.22
108,"Extraction, Quickblade Of Trembling Hands",9,3.53,31.77
82,Nirvana,9,4.90,44.10
19,"Pursuit, Cudgel of Necromancy",8,1.02,8.16

In [9]:
# Sample output

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77
82,Nirvana,9,$4.90,$44.10
19,"Pursuit, Cudgel of Necromancy",8,$1.02,$8.16

## Most Profitable Items

* Sort the above table by total purchase value in descending order

* Optional: give the displayed data cleaner formatting

* Display a preview of the data frame

In [59]:
# Sort summary by 'Total Purchase Value' in descending order
itemSummary.sort_values(by='Total Purchase Value', ascending=False, inplace=True)

# Format 'Item Price' and 'Total Purchase Value' columns as currency
itemSummary.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
82,Nirvana,9,4.90,44.10
145,Fiery Glass Crusader,9,4.58,41.22
92,Final Critic,8,4.88,39.04
103,Singed Scalpel,8,4.35,34.80

In [10]:
# Sample output

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
92,Final Critic,8,$4.88,$39.04
103,Singed Scalpel,8,$4.35,$34.80